package com.example.gamegoroda;

import android.app.Activity;
import android.content.Context;
import android.support.v4.content.ContextCompat;
import android.util.Log;
import android.widget.TextView;
import android.widget.Toast;

import java.io.BufferedReader;
import java.io.File;
import java.io.FileNotFoundException;
import java.io.IOException;
import java.io.InputStream;
import java.io.InputStreamReader;
import java.io.OutputStreamWriter;
import java.nio.file.Paths;
import java.util.ArrayList;
import java.util.Arrays;
import java.util.Collection;
import java.util.Collections;
import java.util.Random;

import static java.security.AccessController.getContext;

public class Data{

//    void Legasy{
//        {
//            int[][] matrix = new int[29][];
//            int[] array;
//
//            //Метод проверяет, присутствует ли введёный город в списке
//            String ConfirmTown (String key, String Message, String pastText, Context ctx){
//
//            String FileName = "towns" + key;
//            try {
//                InputStream inputStream = ctx.openFileInput(FileName);
//                if (inputStream != null) {
//                    InputStreamReader inputStreamReader = new InputStreamReader(inputStream);
//                    BufferedReader bufferedReader = new BufferedReader(inputStreamReader);
//                    String tempString = "";
//                    Log.d("MESS", Message);
//                    while ((tempString = bufferedReader.readLine()) != null) {
//                        if (tempString.equals(Message)) {
//                            Message = Responce(Message, pastText, ctx);
//                            break;
//                        }
//                    }
//                    if (tempString == null) {
//                        TextView textView = (TextView) ((Activity) ctx).findViewById(R.id.textView4);
//                        textView.setText(" - Указанного города не существует");
//                        return (pastText);
//                    }
//                    inputStream.close();
//                }
//            } catch (IOException e) {
//                Log.e("Exception", "File read failed: " + e.toString());
//            }
//            return (Message);
//        }
//
//            String Responce (String word, String pastText, Context ctx){
//
//            if (checkHistory(word, ctx)) {
//                TextView textView = (TextView) ((Activity) ctx).findViewById(R.id.textView4);
//                textView.setText(" - Вы уже называли этот город");
//                return (pastText);
//            } else
//                printHistory(word, ctx);
//
//            String lastSymb = getLastChar(word);
//            String fName = "towns" + lastSymb;
//            String str = "";
//
//            boolean check = true;
//            //fillMatrix(ctx);
//            while (check) {
//                str = randomWord(fName, lastSymb, ctx);
//
//                check = checkHistory(str, ctx);
//                // Для рандома написать "хрень" что-бы числа не повторялись
//                // А так же, проигрыш
//            }
//            printHistory(str, ctx);
//
//            word = str;
//            return (word);
//        }
//
//            //checkHishory возвращает true, если слово уже есть в истории
//            private boolean checkHistory (String s, Context ctx){
//            try {
//                InputStream inputStream = ctx.openFileInput("UserHistory");
//                if (inputStream != null) {
//                    InputStreamReader inputStreamReader = new InputStreamReader(inputStream);
//                    BufferedReader bufferedReader = new BufferedReader(inputStreamReader);
//                    String tempString = "";
//                    while ((tempString = bufferedReader.readLine()) != null) {
//                        Log.d("UserHistory: ", tempString);
//                        if (tempString.equals(s)) {
//                            return (true);
//                        }
//                    }
//                    inputStream.close();
//                }
//            } catch (FileNotFoundException e) {
//                Log.e("FileNF", e.toString());
//                Log.e("FileNF", "Don't Worry its first word");
//            } catch (IOException e) {
//                Log.d("Exception: ", e.toString());
//            }
//            return (false);
//        }
//
//            //Метод, записывающий слово в историю
//
//            String randomWord (String fName, String lastSymb, Context ctx){
//
//            String tempString = "";
//            int k = 0;
//            try {
//                InputStream inputStream = ctx.openFileInput(fName);
//                if (inputStream != null) {
//                    InputStreamReader inputStreamReader = new InputStreamReader(inputStream);
//                    BufferedReader bufferedReader = new BufferedReader(inputStreamReader);
//                    tempString = "";
//                    while ((tempString = bufferedReader.readLine()) != null) {
//                        k++;
//                    }
//                    inputStream.close();
//                }
//            } catch (IOException e) {
//                Log.e("Exception", "Failed reader: " + e.toString());
//            }
//            int rand = (int) (Math.random() * k);
//            k = 0;
//            try {
//                InputStream inputStream = ctx.openFileInput(fName);
//                if (inputStream != null) {
//                    InputStreamReader inputStreamReader = new InputStreamReader(inputStream);
//                    BufferedReader bufferedReader = new BufferedReader(inputStreamReader);
//                    tempString = "";
//                    while ((tempString = bufferedReader.readLine()) != null) {
//                        if (k == rand) {
//                            return (tempString);
//                        }
//                        k++;
//                    }
//                    inputStream.close();
//                }
//            } catch (IOException e) {
//                Log.e("Exception", "Failed reader: " + e.toString());
//            }
//            return ("Error, see Log");
//        }
//
//            void fillAray (Context ctx){
//            String tempString = "";
//
//            for (int i = 0; i < 29; i++) {
//
//            }
//            int k = 0;
//            try {
//                InputStream inputStream = ctx.openFileInput("towns");
//                if (inputStream != null) {
//                    InputStreamReader inputStreamReader = new InputStreamReader(inputStream);
//                    BufferedReader bufferedReader = new BufferedReader(inputStreamReader);
//                    while ((tempString = bufferedReader.readLine()) != null) {
//                        k++;
//                    }
//                    inputStream.close();
//                }
//            } catch (IOException e) {
//                Log.e("Exception", "Failed reader: " + e.toString());
//            }
//            array = new int[k];
//            for (int i = 0; i < k; i++) {
//                array[i] = i;
//                Log.d("Array1:", " " + array[i]);
//            }
//            shuffleArray(array);
//            for (int i = 0; i < k; i++) {
//                Log.d("Array2:", " " + array[i]);
//            }
//        }
//
//        }
//    }

    private ArrayList<String> aListHistory = new ArrayList<>();
    private ArrayList<String> aList = new ArrayList<>();
    private ArrayList<String> aListTemp = new ArrayList<>();

    void CreateFileTowns (Context ctx){
        String[] towns = new String[29];
        towns[0] =
                "Абаза\n" + "Абакан\n" + "Абвиль\n" + "Абдулино\n" + "Абиджан\n" + "Абинск\n" + "Абу-Даби\n" + "Абуджа\n" + "Авиньон\n" + "Агидель\n" + "Агадир\n" + "Агрыз\n" + "Адана\n" + "Аддис-Абеба\n" + "Аделаида\n" + "Адыгейск\n" + "Азнакаево\n" + "Азов\n" + "Ак-Довурак\n" +
                        "Акка\n" + "Аккра\n" + "Аксай\n" + "Актау\n" + "Актюбинск\n" + "Алагир\n" + "Алапаевск\n" + "Алатырь\n" + "Алдан\n" + "Алейск\n" + "Александрия\n" + "Алжир\n" + "Александров\n" + "Александровск\n" + "Александровск-Сахалинский\n" + "Алексеевка\n" + "Алексин\n" + "Алжир\n" +
                        "Алзамай\n" + "Альметьевск\n" + "Амман\n" + "Амстердам\n" + "Амурск\n" + "Амьен\n" + "Анадырь\n" + "Анапа\n" + "Ангарск\n" + "Андреаполь\n" + "Анжеро-Судженск\n" + "Анива\n" + "Анкара\n" + "Анталья\n" + "Антананариву\n" + "Антверпен\n" + "Аньшань\n" +
                        "Апатиты\n" + "Апиа\n" + "Апрелевка\n" + "Апшеронск\n" + "Арамиль\n" + "Аргун\n" + "Ардатов\n" + "Ардон\n" + "Арзамас\n" + "Аркадак\n" + "Арль\n" + "Армавир\n" + "Арнем\n" + "Арсеньев\n" +
                        "Артём\n" + "Артёмовск\n" + "Артёмовский\n" + "Архангельск\n" + "Асбест\n" + "Асино\n" + "Астана\n" + "Астрахань\n" + "Асунсьон\n" + "Аткарск\n" + "Атырау\n" + "Афины\n" + "Ахмадабад\n" + "Ахтубинск\n" + "Ачинск\n" + "Аша\n" + "Ашдод\n" + "Ашкелон\n" + "Ашхабад";
        towns[1] =
                "Бабаево\n" + "Бабушкин\n" + "Бавлы\n" + "Багдад\n" + "Багратионовск\n" + "Базель\n" + "Байкальск\n" + "Баймак\n" + "Бакал\n" + "Баксан\n" + "Баку\n" + "Балабаново\n" + "Балаково\n" + "Балахна\n" + "Балашиха\n" + "Балашов\n" + "Балей\n" + "Балтийск\n" + "Балыкчи\n" +
                        "Бангалор\n" + "Бангкок\n" + "Бандунг\n" + "Барабинск\n" + "Барнаул\n" + "Барранкилья\n" + "Барселона\n" + "Барыш\n" + "Батайск\n" + "Баткен\n" + "Батуми\n" + "Бежецк\n" + "Бейрут\n" + "Белая Калитва\n" + "Белая Холуница\n" + "Белгород\n" + "Белград\n" + "Белебей\n" +
                        "Белёв\n" + "Белинский\n" + "Белово\n" + "Белогорск\n" + "Белозерск\n" + "Белокуриха\n" + "Беломорск\n" + "Белорецк\n" + "Белореченск\n" + "Белоусово\n" + "Белоярский\n" + "Белу-Оризонти\n" + "Бельфор\n" + "Белый\n" + "Берген\n" + "Бердск\n" + "Березники\n" + "Берёзовский\n" +
                        "Берн\n" + "Берлин\n" + "Беслан\n" + "Бийск\n" + "Бикин\n" + "Билибино\n" + "Биньямина\n" + "Бирмингем\n" + "Биробиджан\n" + "Бирск\n" + "Бирюсинск\n" + "Бирюч\n" + "Бишкек\n" + "Благовещенск\n" + "Благодарный\n" + "Блед\n" + "Бобров\n" + "Бобруйск\n" + "Богданович\n" +
                        "Богородицк\n" + "Богородск\n" + "Богота\n" + "Боготол\n" + "Богучар\n" + "Бодайбо\n" + "Бокситогорск\n" + "Болгар\n" + "Бологое\n" + "Болотное\n" + "Болохово\n" + "Болхов\n" + "Большой Камень\n" + "Бор\n" + "Бордо\n" + "Борзя\n" + "Борисов\n" + "Борисоглебск\n" +
                        "Боровичи\n" + "Боровск\n" + "Бородино\n" + "Бохум\n" + "Бразилиа\n" + "Братислава\n" + "Братск\n" + "Бреда\n" + "Бремен\n" + "Брест\n" + "Брисбен\n" + "Бристоль\n" + "Брно\n" + "Бронницы\n" + "Брюгге\n" + "Брюссель\n" + "Брянск\n" + "Бугульма\n" + "Бугуруслан\n" + "Будапешт\n" +
                        "Будённовск\n" + "Бузулук\n" + "Буинск\n" + "Буй\n" + "Буйнакск\n" + "Бутурлиновка\n" + "Бухара\n" + "Бухарест\n" + "Буэнос-Айрес\n" + "Бхопал";
        towns[2] =
                "Вадодара\n" + "Валдай\n" + "Валенсия\n" + "Валуйки\n" + "Варна\n" + "Варшава\n" + "Вашингтон\n" + "Веймар\n" + "Велиж\n" + "Великие Луки\n" + "Великий Новгород\n" + "Великий Устюг\n" + "Веллингтон\n" + "Вельск\n" + "Вена\n" + "Венеция\n" + "Венёв\n" + "Вентспислс\n" + "Верещагино\n" +
                        "Верея\n" + "Вернигнроде\n" + "Верхнеуральск\n" + "Верхний Тагил\n" + "Верхний Уфалей\n" + "Верхняя Пышма\n" + "Верхняя Салда\n" + "Верхняя Тура\n" + "Верхотурье\n" + "Верхоянск\n" + "Весьегонск\n" + "Ветлуга\n" + "Видное\n" + "Вильнюс\n" + "Вилюйск\n" + "Вилючинск\n" + "Витебск\n" +
                        "Вихоревка\n" + "Вичуга\n" + "Владивосток\n" + "Владикавказ\n" + "Владимир\n" + "Волгоград\n" + "Волгодонск\n" + "Волгореченск\n" + "Волжск\n" + "Волжский\n" + "Вологда\n" + "Володарск\n" + "Волоколамск\n" + "Волосово\n" + "Волхов\n" + "Волчанск\n" + "Вольск\n" + "Воркута\n" + "Воронеж\n" +
                        "Ворсма\n" + "Воскресенск\n" + "Воткинск\n" + "Вроцлав\n" + "Всеволожск\n" + "Вуктыл\n" + "Выборг\n" + "Выкса\n" + "Высоковск\n" + "Высоцк\n" + "Вытегра\n" + "Вышний Волочёк\n" + "Вяземский\n" + "Вязники\n" + "Вязьма\n" + "Вятские Поляны\n";
        towns[3] =
                "Гаага\n" + "Гавана\n" + "Гаврилов Посад\n" + "Гаврилов-Ям\n" + "Гагарин\n" + "Гагра\n" + "Гай\n" + "Галич\n" + "Галле\n" + "Гамбург\n" + "Ганновер\n" + "Гаосюн\n" + "Гатчина\n" + "Гауда\n" + "Гвадалахара\n" + "Гвардейск\n" + "Гватемала\n" + "Гданьск\n" + "Гдов\n" + "Геленджик\n" +
                        "Гент\n" + "Георгиевск\n" + "Гётеборг\n" + "Гирин\n" + "Глазго\n" + "Глазов\n" + "Голицыно\n" + "Гонконг\n" + "Гомель\n" + "Горбатов\n" + "Горно-Алтайск\n" + "Горнозаводск\n" + "Горняк\n" + "Городец\n" + "Городище\n" + "Городовиковск\n" + "Гороховец\n" + "Горячий Ключ\n" + "Грайворон\n" +
                        "Гремячинск\n" + "Гродно\n" + "Грозный\n" + "Гронинген\n" + "Грязи\n" + "Грязовец\n" + "Гуанчжоу\n" + "Гуаякиль\n" + "Губаха\n" + "Губкин\n" + "Губкинский\n" + "Гудермес\n" + "Гуйян\n" + "Гуково\n" + "Гулькевичи\n" + "Гурьевск\n" + "Гусев\n" + "Гусиноозёрск\n" + "Гусь-Хрустальный";
        towns[4] =
                "Давлеканово\n" + "Дагестанские Огни\n" + "Дакар\n" + "Дакка\n" + "Даллас\n" + "Далматово\n" + "Дальнегорск\n" + "Дальнереченск\n" + "Далянь\n" + "Дамаск\n" + "Данилов\n" + "Данков\n" + "Дар-эс-Салам\n" + "Даугавпилс\n" + "Дегтярск\n" + "Дедовск\n" + "Делфт\n" + "Дели\n" + "Демидов\n" +
                        "Дербент\n" + "Десногорск\n" + "Джайпур\n" + "Джакарта\n" + "Дзержинск\n" + "Дзержинский\n" + "Дивногорск\n" + "Дигора\n" + "Димитровград\n" + "Дмитриев-Льговский\n" + "Дмитров\n" + "Дмитровск\n" + "Днепропетровск\n" + "Дно\n" + "Добрянка\n" + "Долгопрудный\n" + "Долинск\n" +
                        "Домодедово\n" + "Донецк\n" + "Донской\n" + "Дорогобуж\n" + "Дрезден\n" + "Дрезна\n" + "Дуала\n" + "Дубай\n" + "Дублин\n" + "Дубна\n" + "Дубовка\n" + "Дубровник\n" + "Дудинка\n" + "Духовщина\n" + "Душанбе\n" + "Дюнкерк\n" + "Дюртюли\n" + "Дюссельдорф\n" + "Дятьково";
        towns[5] =
                "Евпатория\n" + "Егорьевск\n" + "Ейск\n" + "Екатеринбург\n" + "Елабуга\n" + "Елец\n" + "Елизово\n" + "Ельня\n" + "Еманжелинск\n" + "Емва\n" + "Енисейск\n" + "Ереван\n" + "Ершов\n" + "Ессентуки\n" + "Ефремов";
        towns[6] =
                "Железноводск\n" + "Железногорск\n" + "Железногорск-Илимский\n" + "Железнодорожный\n" + "Женева\n" + "Жердевка\n" + "Жигулёвск\n" + "Жиздра\n" + "Жирновск\n" + "Житомир\n" + "Жуков\n" + "Жуковка\n" + "Жуковский";
        towns[7] =
                "Завитинск\n" + "Заводоуковск\n" + "Заволжск\n" + "Заволжье\n" + "Загреб\n" + "Задонск\n" + "Заинск\n" + "Закаменск\n" + "Заозёрный\n" + "Заозёрск\n" + "Западная Двина\n" + "Заполярный\n" + "Запорожье\n" + "Зарайск\n" + "Заречный\n" + "Заринск\n" + "Звенигово\n" + "Звенигород\n" + "Зверево\n" +
                        "Зволле\n" + "Зеленогорск\n" + "Зеленоград\n" + "Зеленоградск\n" + "Зеленодольск\n" + "Зеленокумск\n" + "Зерноград\n" + "Зея\n" + "Зима\n" + "Зихрон Яаков\n" + "Златоуст\n" + "Злынка\n" + "Змеиногорск\n" + "Знаменск\n" + "Зубцов\n" + "Зуевка";
        towns[8] = "Ибадан\n" +
                "Ивангород\n" + "Иваново\n" + "Ивано-Франковск\n" + "Ивантеевка\n" + "Ивдель\n" + "Игарка\n" + "Иерусалим\n" + "Ижевск\n" + "Избербаш\n" + "Измир\n" + "Изобильный\n" + "Иланский\n" + "Индаур\n" + "Инза\n" + "Инсар\n" + "Инсбрук\n" + "Инта\n" + "Инчхон\n" + "Иоккаити\n" + "Иокогама\n" +
                "Ипатово\n" + "Ирбит\n" + "Иркутск\n" + "Исилькуль\n" + "Искитим\n" + "Искогама\n" + "Исламабад\n" + "Ист-Дерри\n" + "Истра\n" + "Исфахан\n" + "Ишим\n" + "Ишимбай";
        towns[9] =
                "Йена\n" + "Йокнеам\n" + "Йорк\n" + "Йоханнесбург\n" + "Йошкар-Ола\n" + "Йоэнсуу";
        towns[10] =
                "Кавасаки\n" + "Кадис\n" + "Кадников\n" + "Казань\n" + "Каир\n" + "Кайеркан\n" + "Калач\n" + "Калач-на-Дону\n" + "Калачинск\n" + "Кале\n" + "Кали\n" + "Калининград\n" + "Калининск\n" + "Калтан\n" + "Калуга\n" + "Калькутта\n" + "Кальян\n" + "Калязин\n" + "Камакура\n" + "Камбарка\n" + "Каменка\n" +
                        "Каменногорск\n" + "Каменск-Уральский\n" + "Каменск-Шахтинский\n" + "Камень-на-Оби\n" + "Камешково\n" + "Камызяк\n" + "Камышин\n" + "Камышлов\n" + "Канаш\n" + "Кандалакша\n" + "Канны\n" + "Канпур\n" + "Канск\n" + "Кант\n" + "Карабаново\n" + "Карабаш\n" + "Карабулак\n" + "Караганда\n" + "Каракас\n" +
                        "Каракол\n" + "Карасук\n" + "Карачаевск\n" + "Карачев\n" + "Карачи\n" + "Каргат\n" + "Каргополь\n" + "Каркассон\n" + "Карловы Вары\n" + "Карлсруэ\n" + "Кармиэль\n" + "Карпинск\n" + "Картахена\n" + "Карталы\n" + "Касабланка\n" + "Касимов\n" + "Касли\n" + "Каспийск\n" + "Катав-Ивановск\n" +
                        "Катайск\n" + "Катакюсю\n" + "Каунас\n" + "Кацуяма\n" + "Качканар\n" + "Кашин\n" + "Кашира\n" + "Кванджу\n" + "Кедровый\n" + "Кемерово\n" + "Кемь\n" + "Кесон-Сити\n" + "Кёльн\n" + "Кзыл-Орда\n" + "Киев\n" + "Кизел\n" + "Кизилюрт\n" + "Кизляр\n" + "Киль\n" + "Кимовск\n" + "Кимры\n" + "Кингисепп\n" + "Кинель\n" +
                        "Кинешма\n" + "Киншаса\n" + "Киреевск\n" + "Киркенес\n" + "Киото\n" + "Киренск\n" + "Киржач\n" + "Кириллов\n" + "Кириши\n" + "Киров\n" + "Кировград\n" + "Кировоград\n" + "Кирово-Чепецк\n" + "Кировск\n" + "Кирс\n" + "Кирсанов\n" + "Кирьят-Шмона\n" + "Киселёвск\n" + "Кисловодск\n" +
                        "Кито\n" + "Кишинев\n" + "Клайпеда\n" + "Кливленд\n" + "Климовск\n" + "Клин\n" + "Клинцы\n" + "Княгинино\n" + "Кобе\n" + "Ковдор\n" + "Ковентри\n" + "Ковров\n" + "Ковылкино\n" + "Когалым\n" + "Кодинск\n" + "Козельск\n" + "Козловка\n" + "Козьмодемьянск\n" + "Коканд\n" +
                        "Кола\n" + "Кологрив\n" + "Коломна\n" + "Колпашево\n" + "Колпино\n" + "Кольчугино\n" + "Коммунар\n" + "Компьень\n" + "Комсомольск\n" + "Комсомольск-на-Амуре\n" + "Конаково\n" + "Конакри\n" + "Кондопога\n" + "Кондрово\n" + "Константиновск\n" + "Копейск\n" + "Копенгаген\n" + "Кораблино\n" + "Кордова\n" +
                        "Кореновск\n" + "Коркино\n" + "Королёв\n" + "Короча\n" + "Корсаков\n" + "Коряжма\n" + "Костерёво\n" + "Костомукша\n" + "Кострома\n" + "Котельники\n" + "Котельниково\n" + "Котельнич\n" + "Котлас\n" + "Котово\n" + "Котовск\n" + "Кохма\n" + "Краков\n" + "Красавино\n" + "Красноармейск\n" +
                        "Красновишерск\n" + "Красногорск\n" + "Краснодар\n" + "Красное Село\n" + "Краснозаводск\n" + "Краснознаменск\n" + "Краснокаменск\n" + "Краснокамск\n" + "Краснослободск\n" + "Краснотурьинск\n" + "Красноуральск\n" + "Красноуфимск\n" + "Красноярск\n" + "Красный Кут\n" + "Красный Сулин\n" +
                        "Красный Холм\n" + "Кремёнки\n" + "Кронштадт\n" + "Кропоткин\n" + "Крымск\n" + "Кстово\n" + "Куала-Лумпур\n" + "Кубинка\n" + "Кувандык\n" + "Кувшиново\n" + "Кудымкар\n" + "Кузнецк\n" + "Кулебаки\n" + "Кумертау\n" + "Кунгур\n" + "Куньмин\n" + "Купино\n" + "Курган\n" + "Курганинск\n" +
                        "Курильск\n" + "Курлово\n" + "Куровское\n" + "Курск\n" + "Куртамыш\n" + "Курчатов\n" + "Куса\n" + "Кустанай\n" + "Кушва\n" + "Кызыл\n" + "Кыштым\n" + "Кяхта";
        towns[11] =
                "Ла-Пас\n" + "Лабинск\n" + "Лабытнанги\n" + "Лагань\n" + "Лагос\n" + "Лаишево\n" + "Лакинск\n" + "Лакхнау\n" + "Лангепас\n" + "Ланьчжоу\n" + "Лаc-Вегас\n" + "Лахденпохья\n" + "Лахор\n" + "Лебедянь\n" + "Лейден\n" + "Лейпциг\n" + "Лелистад\n" + "Ле-Ман\n" + "Лениногорск\n" +
                        "Ленинск\n" + "Ленинск-Кузнецкий\n" + "Ленск\n" + "Лермонтов\n" + "Лесной\n" + "Лесозаводск\n" + "Лесосибирск\n" + "Ливерпуль\n" + "Ливны\n" + "Лидс\n" + "Ликино-Дулёво\n" + "Лилль\n" + "Лима\n" + "Лимассол\n" + "Лимож\n" + "Линкопинг\n" + "Линц\n" + "Лион\n" + "Липецк\n" +
                        "Липки\n" + "Лиски\n" + "Лиссабон\n" + "Лихославль\n" + "Лобня\n" + "Лодейное Поле\n" + "Лозанна\n" + "Ломоносов\n" + "Лондон\n" + "Лос-Анджелес\n" + "Лосино-Петровский\n" + "Луанда\n" + "Лувен\n" + "Луга\n" + "Луганск\n" + "Лудхияна\n" + "Луза\n" + "Лукоянов\n" + "Луховицы\n" +
                        "Луцк\n" + "Лысково\n" + "Лысьва\n" + "Лыткарино\n" + "Львов\n" + "Любань\n" + "Люберцы\n" + "Любим\n" + "Люксембург\n" + "Люцерн\n" + "Лянтор";
        towns[12] =
                "Мааслуис\n" + "Маастрихт\n" + "Магадан\n" + "Магас\n" + "Магдебург\n" + "Магнитогорск\n" + "Мадрас\n" + "Мадрид\n" + "Майкоп\n" + "Майский\n" + "Майами-Бич\n" + "Макарьев\n" + "Макушино\n" + "Малага\n" + "Малая Вишера\n" + "Малгобек\n" + "Малмыж\n" + "Малоархангельск\n" +
                        "Малоярославец\n" + "Мамадыш\n" + "Мамоново\n" + "Манаус\n" + "Манила\n" + "Мантурово\n" + "Манчестер\n" + "Мапуту\n" + "Маракайбо\n" + "Мариинск\n" + "Мариинский Посад\n" + "Маркс\n" + "Марракеш\n" + "Марсель\n" + "Маршалл\n" + "Махачкала\n" + "Мглин\n" + "Мегион\n" + "Медан\n" +
                        "Медвежьегорск\n" + "Медельин\n" + "Медногорск\n" + "Медынь\n" + "Межгорье\n" + "Междуреченск\n" + "Мезень\n" + "Меленки\n" + "Мелеуз\n" + "Мельбурн\n" + "Менделеевск\n" + "Мензелинск\n" + "Мехико\n" + "Мешхед\n" + "Мещовск\n" + "Миасс\n" + "Мидделбург\n" + "Микунь\n" + "Милан\n" +
                        "Миллерово\n" + "Минеральные Воды\n" + "Минск\n" + "Минусинск\n" + "Миньяр\n" + "Мирный\n" + "Михайлов\n" + "Михайловка\n" + "Михайловск\n" + "Мичуринск\n" + "Могилёв\n" + "Могоча\n" + "Можайск\n" + "Можга\n" + "Моздок\n" + "Монреаль\n" + "Монтевидео\n" + "Монтеррей\n" + "Монтре\n" +
                        "Мончегорск\n" + "Морозовск\n" + "Моршанск\n" + "Мосальск\n" + "Москва\n" + "Московский\n" + "Мосс\n" + "Мостар\n" + "Мумбаи\n" + "Муравленко\n" + "Мураши\n" + "Мурманск\n" + "Муром\n" + "Мценск\n" + "Мыски\n" + "Мытищи\n" + "Мышкин\n" + "Мюнхен";
        towns[13] =
                "Набережные Челны\n" + "Навашино\n" + "Наволоки\n" + "Нагоя\n" + "Нагпур\n" + "Надым\n" + "Назарет\n" + "Назарово\n" + "Назрань\n" + "Называевск\n" + "Найменген\n" + "Найроби\n" + "Нальчик\n" + "Нанкин\n" + "Наньчан\n" + "Нарва\n" + "Нариманов\n" + "Наро-Фоминск\n" + "Нарткала\n" +
                        "Нарьян-Мар\n" + "Нарын\n" + "Нахичевань\n" + "Находка\n" + "Неаполь\n" + "Невель\n" + "Невельск\n" + "Невинномысск\n" + "Невьянск\n" + "Нелидово\n" + "Неман\n" + "Нерехта\n" + "Нерчинск\n" + "Нерюнгри\n" + "Несаулькойотль\n" + "Несвиж\n" + "Нестеров\n" + "Нефтегорск\n" + "Нефтекамск\n" + "Нефтекумск\n" +
                        "Нефтеюганск\n" + "Нея\n" + "Нижневартовск\n" + "Нижнекамск\n" + "Нижнеудинск\n" + "Нижние Серги\n" + "Нижний Ломов\n" + "Нижний Новгород\n" + "Нижний Тагил\n" + "Нижняя Салда\n" + "Нижняя Тура\n" + "Николаев\n" + "Николаевск\n" + "Николаевск-на-Амуре\n" + "Никольск\n" + "Никольское\n" + "Никосия\n" + "Ницца\n" + "Новая Ладога\n" +
                        "Новая Ляля\n" + "Новоалександровск\n" + "Новоалтайск\n" + "Новоаннинский\n" + "Нововоронеж\n" + "Новодвинск\n" + "Новозыбков\n" + "Новокубанск\n" + "Новокузнецк\n" + "Новокуйбышевск\n" + "Новомичуринск\n" + "Новомосковск\n" + "Новопавловск\n" + "Новоржев\n" + "Новороссийск\n" + "Новосибирск\n" + "Новосиль\n" + "Новосокольники\n" + "Новотроицк\n" + "Новоузенск\n" +
                        "Новоульяновск\n" + "Новоуральск\n" + "Новохопёрск\n" + "Новочебоксарск\n" + "Новочеркасск\n" + "Новошахтинск\n" + "Новый Оскол\n" + "Новый Уренгой\n" + "Ногинск\n" + "Нолинск\n" + "Норильск\n" + "Ноябрьск\n" + "Нукуалофа\n" + "Нурлат\n"+ "Нурсултан\n" + "Нью-Дели\n" + "Нью-Йорк\n" + "Нытва\n" + "Нюрба\n" + "Нягань\n" + "Нязепетровск\n" + "Няндома";
        towns[14] =
                "Облучье\n" + "Обнинск\n" + "Обоянь\n" + "Обь\n" + "Одесса\n" + "Одинцово\n" + "Ожерелье\n" + "Озёрск\n" + "Озёры\n" + "Окленд\n" + "Октябрьск\n" + "Октябрьский\n" + "Окуловка\n" + "Олёкминск\n" + "Оленегорск\n" + "Оломоуц\n" + "Олонец\n" + "Ольштын\n" + "Омдурман\n" +
                        "Омск\n" + "Омута\n" + "Омутнинск\n" + "Онега\n" + "Опочка\n" + "Орёл\n" + "Оренбург\n" + "Орехово-Зуево\n" + "Орлов\n" + "Орск\n" + "Орхус\n" + "Оса\n" + "Осака\n" + "Осинники\n" + "Осло\n" + "Осташков\n" + "Остров\n" + "Островной\n" + "Острогожск\n" +
                        "Отрадное\n" + "Отрадный\n" + "Оттава\n" + "Оха\n" + "Оханск\n" + "Очёр\n" + "Ош";
        towns[15] =
                "Павлово\n" + "Павловск\n" + "Павловский Посад\n" + "Павлодар\n" + "Палембанг\n" + "Палермо\n" + "Палласовка\n" + "Пангаи\n" + "Паневежис\n" + "Париж\n" + "Партизанск\n" + "Певек\n" + "Пенза\n" + "Первомайск\n" + "Первоуральск\n" + "Перевоз\n" + "Пересвет\n" + "Переславль-Залесский\n" + "Пекин\n" +
                        "Пермь\n" + "Перт\n" + "Пестово\n" + "Петах-Тиква\n" + "Петергоф/ Петродворец\n" + "Петров Вал\n" + "Петровск\n" + "Петровск-Забайкальский\n" + "Петрозаводск\n" + "Петропавловск-Камчатский\n" + "Петухово\n" + "Петушки\n" + "Печора\n" + "Печоры\n" + "Пикалёво\n" + "Пионерский\n" + "Питкяранта\n" + "Плёс\n" + "Плавск\n" +
                        "Пласт\n" + "Поворино\n" + "Подольск\n" + "Подпорожье\n" + "Познань\n" + "Покачи\n" + "Покров\n" + "Покровск\n" + "Полевской\n" + "Полесск\n" + "Полоцк\n" + "Полтава\n" + "Полысаево\n" + "Полярные Зори\n" + "Полярный\n" + "Поронайск\n" + "Портленд\n" + "Порту-Алегри\n" + "Порхов\n" +
                        "Потсдам\n" + "Похвистнево\n" + "Почеп\n" + "Починок\n" + "Пошехонье\n" + "Правдинск\n" + "Прага\n" + "Приволжск\n" + "Приморск\n" + "Приморско-Ахтарск\n" + "Приозерск\n" + "Провиденс\n" + "Прокопьевск\n" + "Пролетарск\n" + "Протвино\n" + "Прохладный\n" + "Псков\n" + "Пугачёв\n" +
                        "Пудож\n" + "Пуна\n" + "Пусан\n" + "Пустошка\n" + "Пучеж\n" + "Пушкин\n" + "Пушкино\n" + "Пущино\n" + "Пуэбла\n" + "Пхеньян\n" + "Пыталово\n" + "Пыть-Ях\n" + "Пятигорск";
        towns[16] =
                "Рабат\n" + "Радужный\n" + "Райчихинск\n" + "Раменское\n" + "Рассказово\n" + "Ревда\n" + "Реж\n" + "Резекне\n" + "Реймс\n" + "Ресифи\n" + "Реутов\n" + "Ржев\n" + "Рига\n" + "Рим\n" + "Рио-де-Жанейро\n" + "Ричмонд\n" + "Ришон-ле-Цион\n" + "Ровно\n" + "Родники\n" +
                        "Рославль\n" + "Россошь\n" + "Ростов\n" + "Ростов-на-Дону\n" + "Росток\n" + "Роттердам\n" + "Рошаль\n" + "Ртищево\n" + "Рубцовск\n" + "Рудня\n" + "Руза\n" + "Рузаевка\n" + "Рыбинск\n" + "Рыбное\n" + "Рыльск\n" + "Ряжск\n" + "Рязань";
        towns[17] =
                "Салават\n" + "Салаир\n" + "Салвадор\n" + "Салехард\n" + "Салинас\n" + "Сало\n" + "Сальск\n" + "Самара\n" + "Самарканд\n" + "Сан-Антонио\n" + "Сан-Диего\n" + "Санкт-Петербург\n" + "Сан-Паулу\n" + "Санто-Доминго\n" + "Сантьяго\n" + "Сан-Франциско\n" + "Сан-Хосе\n" + "Сан-Хусто\n" + "Саппоро\n" + "Саранск\n" + "Сарапул\n" +
                        "Саратов\n" + "Саров\n" + "Сасово\n" + "Сатка\n" + "Сафоново\n" + "Саяногорск\n" + "Саянск\n" + "Светлогорск\n" + "Светлоград\n" + "Светлый\n" + "Светогорск\n" + "Свирск\n" + "Свободный\n" + "Себеж\n" + "Севастополь\n" + "Северо-Курильск\n" + "Северобайкальск\n" + "Северодвинск\n" + "Североморск\n" + "Североуральск\n" + "Северск\n" +
                        "Севск\n" + "Сегежа\n" + "Сельцо\n" + "Семаранг\n" + "Семёнов\n" + "Семикаракорск\n" + "Семилуки\n" + "Семипалатинск\n" + "Сенгилей\n" + "Сент-пол\n" + "Серафимович\n" + "Сергач\n" + "Сергиев Посад\n" + "Сердобск\n" + "Серов\n" + "Серпухов\n" + "Сертолово\n" + "Сестрорецк\n" + "Сеул\n" + "Сиань\n" + "Сибай\n" +
                        "Сидней\n" + "Силламяэ\n" + "Сим\n" + "Симферополь\n" + "Сингапур\n" + "Сковородино\n" + "Скопин\n" + "Славгород\n" + "Славск\n" + "Славянск-на-Кубани\n" + "Сланцы\n" + "Слободской\n" + "Слюдянка\n" + "Смоленск\n" + "Снежинск\n" + "Снежногорск\n" + "Собинка\n" + "Советск\n" +
                        "Советская Гавань\n" + "Советский\n" + "Сокол\n" + "Сокольники\n" + "Солигалич\n" + "Соликамск\n" + "Солнечногорск\n" + "Соль-Илецк\n" + "Сольвычегодск\n" + "Солт-Лейк-Сити\n" + "Сольцы\n" + "Сорочинск\n" + "Сорск\n" + "Сортавала\n" + "Сосенский\n" + "Сосновка\n" + "Сосновоборск\n" + "Сосновый Бор\n" + "Сосногорск\n" +
                        "София\n" + "Сочи\n" + "Спас-Деменск\n" + "Спас-Клепики\n" + "Спасск\n" + "Спасск-Дальний\n" + "Спасск-Рязанский\n" + "Сплит\n" + "Спрингфилд\n" + "Среднеколымск\n" + "Среднеуральск\n" + "Сретенск\n" + "Ставрополь\n" + "Стамбул\n" + "Старая Купавна\n" + "Старая Русса\n" + "Старица\n" + "Стародуб\n" +
                        "Старый Оскол\n" + "Степанакерт\n" + "Стерлитамак\n" + "Стокгольм\n" + "Страсбург\n" + "Стрежевой\n" + "Строитель\n" + "Струнино\n" + "Ступино\n" + "Суворов\n" + "Суджа\n" + "Судогда\n" + "Суздаль\n" + "Сумы\n" + "Суоярви\n" + "Сурабая\n" + "Сураж\n" + "Сурат\n" + "Сургут\n" +
                        "Суровикино\n" + "Сурск\n" + "Сусуман\n" + "Сухиничи\n" + "Сухой Лог\n" + "Сухум\n" + "Сходня\n" + "Сызрань\n" + "Сыктывкар\n" + "Сысерть\n" + "Сычёвка\n" + "Сянган\n" + "Сясьстрой";
        towns[18] =
                "Тавда\n" + "Таганрог\n" + "Тайбэй\n" + "Тайга\n" + "Тайшет\n" + "Тайюань\n" + "Талас\n" + "Талдом\n" + "Талица\n" + "Таллин (Таллинн)\n" + "Талнах\n" + "Тамбов\n" + "Тампере\n" + "Таншань\n" + "Тара\n" + "Тарко-Сале\n" + "Тарту\n" + "Таруса\n" + "Татарск\n" +
                        "Ташкент\n" + "Таштагол\n" + "Тбилиси\n" + "Тверия\n" + "Тверь\n" + "Теберда\n" + "Тебриз\n" + "Тегеран\n" + "Тейково\n" + "Тель-Авив\n" + "Темников\n" + "Темрюк\n" + "Терек\n" + "Тернополь\n" + "Тетюши\n" + "Тилбург\n" + "Тимашёвск\n" + "Тирасполь\n" + "Тихвин\n" +
                        "Тихорецк\n" + "Тобольск\n" + "Тогучин\n" + "Токио\n" + "Токмак\n" + "Тольятти\n" + "Томари\n" + "Томмот\n" + "Томск\n" + "Топки\n" + "Торжок\n" + "Торонто\n" + "Торопец\n" + "Тосно\n" + "Тотьма\n" + "Трёхгорный\n" + "Троицк\n" + "Тромсё\n" + "Тронхейм\n" + "Трубчевск\n" + "Туапсе\n" +
                        "Туймазы\n" + "Тула\n" + "Тулуза\n" + "Тулун\n" + "Туран\n" + "Туринск\n" + "Тутаев\n" + "Тында\n" + "Тырныауз\n" + "Тэгу\n" + "Тэджон\n" + "Тюкалинск\n" + "Тюмень\n" + "Тяньцзинь";
        towns[19] =
                "Уварово\n" + "Углегорск\n" + "Углич\n" + "Удачный\n" + "Удомля\n" + "Ужгород\n" + "Ужур\n" + "Узловая\n" + "Улан-Удэ\n" + "Ульяновск\n" + "Унеча\n" + "Урай\n" + "Ургенч\n" + "Урень\n" + "Уржум\n" + "Урумчи\n" + "Урус-Мартан\n" + "Урюпинск\n" +
                        "Усинск\n" + "Усмань\n" + "Усолье\n" + "Усолье-Сибирское\n" + "Уссурийск\n" + "Усть-Джегута\n" + "Усть-Илимск\n" + "Усть-Катав\n" + "Усть-Кут\n" + "Усть-Лабинск\n" + "Устюжна\n" + "Утрехт\n" + "Уфа\n" + "Ухань\n" + "Ухта\n" + "Учалы\n" + "Учкудук\n" + "Уяр";
        towns[20] =
                "Фатеж\n" + "Фейсалабад\n" + "Феодосия\n" + "Филадельфия\n" + "Финикс\n" + "Флоренция\n" + "Фокино\n" + "Франкфурт-на-Майне\n" + "Франкфурт-на-Одере\n" + "Фролово\n" + "Фромборк\n" + "Фрязино\n" + "Фукуока\n" + "Фурманов\n" + "Фушунь";
        towns[21] =
                "Хабаровск\n" + "Хадера\n" + "Хадыженск\n" + "Хайдерабад\n" + "Хайфа\n" + "Хайфон\n" + "Халеб\n" + "Ханой\n" + "Ханты-Мансийск\n" + "Ханчжоу\n" + "Харабали\n" + "Хараре\n" + "Харбин\n" + "Харлем\n" + "Харовск\n" + "Харьков\n" + "Хасавюрт\n" + "Хелдер\n" + "Хеврон\n" +
                        "Хельсинки\n" + "Херсон\n" + "Хертогенбос\n" + "Хвалынск\n" + "Хилок\n" + "Химки\n" + "Хиросима\n" + "Хмельницкий\n" + "Холм\n" + "Холмск\n" + "Холон\n" + "Хотьково\n" + "Хошимин\n" + "Хьюстон";
        towns[22] =
                "Цзинань\n" + "Цфат\n" + "Цхинвал\n" + "Цивильск\n" + "Цзыбо\n" + "Цюрих\n" + "Цимлянск\n" + "Цимлянск\n" + "Цзюлун\n" + "Цицикар\n" + "Цукуба\n" + "Циндао";
        towns[23] =
                "Чадан\n" + "Чайковский\n" + "Чанша\n" + "Чаньчунь\n" + "Чапаевск\n" + "Чаплыгин\n" + "Чебаркуль\n" + "Чебоксары\n" + "Чегем\n" + "Чекалин\n" + "Челябинск\n" + "Чердынь\n" + "Черемхово\n" + "Черепаново\n" + "Череповец\n" + "Черкассы\n" + "Черкесск\n" + "Чермоз\n" + "Чернигов\n" + "Черновцы\n" +
                        "Черноголовка\n" + "Черногорск\n" + "Чернушка\n" + "Черняховск\n" + "Чехов\n" + "Чикаго\n" + "Чистополь\n" + "Чита\n" + "Читтагонг\n" + "Чкаловск\n" + "Чолпон-Ата\n" + "Чудово\n" + "Чулым\n" + "Чунцин\n" + "Чусовой\n" + "Чухлома\n" + "Чэнду";
        towns[24] =
                "Шагонар\n" + "Шадринск\n" + "Шали\n" + "Шанхай\n" + "Шарджа\n" + "Шарлеруа\n" + "Шартр\n" + "Шарыпово\n" + "Шарья\n" + "Шатки\n" + "Шатура\n" + "Шахтёрск\n" + "Шахты\n" + "Шахунья\n" + "Шацк\n" + "Шверин\n" + "Шебекино\n" + "Шевченко\n" + "Шелехов\n" +
                        "Шенкурск\n" + "Шеффилд\n" + "Шилка\n" + "Шимановск\n" + "Шиханы\n" + "Шклов\n" + "Шлиссельбург\n" + "Штутгарт\n" + "Шумерля\n" + "Шумиха\n" + "Шуя\n" + "Шымкент\n" + "Шэньян";
        towns[25] =
                "Щербинка\n" + "Щецин\n" + "Щёкино\n" + "Щёлково\n" + "Щигры\n" + "Щучинск\n" + "Щучье";
        towns[26] =
                "Эйлат\n" + "Эйндховен\n" + "Электрогорск\n" + "Электросталь\n" + "Электроугли\n" + "Элиста\n" + "Эль-Гиза\n" + "Эль-Кувейт\n" + "Энгельс\n" + "Энсхеде\n" + "Эр-Рияд\n" + "Эртиль\n" + "Эрфурт\n" + "Эсберг\n" + "Эспоо\n" + "Эссен";
        towns[27] =
                "Юбилейный\n" + "Югорск\n" + "Южа\n" + "Южно-Сахалинск\n" + "Южно-Сухокумск\n" + "Южноуральск\n" + "Юрга\n" + "Юрмала\n" + "Юрьев-Польский\n" + "Юрьевец\n" + "Юрюзань\n" + "Юхнов";
        towns[28] =
                "Ядрин\n" + "Якутск\n" + "Ялта\n" + "Ялуторовск\n" + "Янаул\n" + "Янгон\n" + "Яранск\n" + "Яровое\n" + "Ярославль\n" + "Ярцево\n" + "Ясногорск\n" + "Ясный\n" + "Яхрома";
        try {
            for (int i = 0; i < 29; i++) {
                String TownFileName = "towns" + i;
                OutputStreamWriter outputStreamWriter = new OutputStreamWriter(ctx.openFileOutput(TownFileName, ctx.MODE_PRIVATE));
                outputStreamWriter.write(towns[i]);
                outputStreamWriter.close();
            }
        } catch (FileNotFoundException e) {
            Log.e("Exception", "File not founded: " + e.toString());
        } catch (IOException e) {
            Log.e("Exception", "File write failed: " + e.toString());
        }
    }
    void CreateFileNames (Context ctx){
        String[] names = new String[2];
        names[0] = "Абакум\n" +
                "Абрам\n" +
                "Абросим\n" +
                "Аввакум\n" +
                "Август\n" +
                "Авдей\n" +
                "Авдий\n" +
                "Авель\n" +
                "Авенир\n" +
                "Аверий\n" +
                "Аверкий\n" +
                "Аверьян\n" +
                "Авксентий\n" +
                "Аврам\n" +
                "Аврелиан\n" +
                "Автоном\n" +
                "Агап\n" +
                "Агапий\n" +
                "Агапит\n" +
                "Агафангел\n" +
                "Агафон\n" +
                "Аггей\n" +
                "Адам\n" +
                "Адриан\n" +
                "Азар\n" +
                "Азарий\n" +
                "Акакий\n" +
                "Акила\n" +
                "Аким\n" +
                "Акиндин\n" +
                "Акинф\n" +
                "Акинфий\n" +
                "Аксён\n" +
                "Аксентий\n" +
                "Александр\n" +
                "Алексей\n" +
                "Алексий\n" +
                "Альберт\n" +
                "Альфред\n" +
                "Амвросий\n" +
                "Амос\n" +
                "Амфилохий\n" +
                "Ананий\n" +
                "Анастасий\n" +
                "Анатолий\n" +
                "Андрей\n" +
                "Андриан\n" +
                "Андрон\n" +
                "Андроний\n" +
                "Андроник\n" +
                "Анект\n" +
                "Анемподист\n" +
                "Аникей\n" +
                "Аникий\n" +
                "Аникита\n" +
                "Анисий\n" +
                "Анисим\n" +
                "Антиох\n" +
                "Антип\n" +
                "Антипа\n" +
                "Антипий\n" +
                "Антон\n" +
                "Антонин\n" +
                "Антроп\n" +
                "Антропий\n" +
                "Ануфрий\n" +
                "Аполлинарий\n" +
                "Аполлон\n" +
                "Аполлос\n" +
                "Ардалион\n" +
                "Ардальон\n" +
                "Ареф\n" +
                "Арефий\n" +
                "Арий\n" +
                "Аристарх\n" +
                "Аристид\n" +
                "Аркадий\n" +
                "Арнольд\n" +
                "Арон\n" +
                "Арсений\n" +
                "Арсентий\n" +
                "Артамон\n" +
                "Артём\n" +
                "Артемий\n" +
                "Артур\n" +
                "Архип\n" +
                "Асаф\n" +
                "Асафий\n" +
                "Аскольд\n" +
                "Афанасий\n" +
                "Афиноген\n" +
                "Афинодор\n" +
                "Африкан\n" +
                "Бажен\n" +
                "Бенедикт\n" +
                "Богдан\n" +
                "Болеслав\n" +
                "Бонифат\n" +
                "Бонифатий\n" +
                "Борис\n" +
                "Борислав\n" +
                "Бронислав\n" +
                "Будимир\n" +
                "Буянто\n" +
                "Вавила\n" +
                "Вадим\n" +
                "Валентин\n" +
                "Валериан\n" +
                "Валерий\n" +
                "Варлам\n" +
                "Варламий\n" +
                "Варнава\n" +
                "Варсоноф\n" +
                "Варсонофий\n" +
                "Варфоломей\n" +
                "Василий\n" +
                "Вассиан\n" +
                "Велизар\n" +
                "Велимир\n" +
                "Венедикт\n" +
                "Вениамин\n" +
                "Венцеслав\n" +
                "Веньямин\n" +
                "Викентий\n" +
                "Виктор\n" +
                "Викторий\n" +
                "Викул\n" +
                "Викула\n" +
                "Вилен\n" +
                "Виленин\n" +
                "Вильгельм\n" +
                "Виссарион\n" +
                "Вит\n" +
                "Виталий\n" +
                "Витовт\n" +
                "Витольд\n" +
                "Владилен\n" +
                "Владимир\n" +
                "Владислав\n" +
                "Владлен\n" +
                "Влас\n" +
                "Власий\n" +
                "Вонифат\n" +
                "Вонифатий\n" +
                "Всеволод\n" +
                "Всеслав\n" +
                "Вукол\n" +
                "Вышеслав\n" +
                "Вячеслав\n" +
                "Гавриил\n" +
                "Гаврил\n" +
                "Гаврила\n" +
                "Галактион\n" +
                "Гедеон\n" +
                "Гедимин\n" +
                "Геласий\n" +
                "Гелий\n" +
                "Геннадий\n" +
                "Генрих\n" +
                "Георгий\n" +
                "Герасим\n" +
                "Гервасий\n" +
                "Герман\n" +
                "Гермоген\n" +
                "Геронтий\n" +
                "Гиацинт\n" +
                "Глеб\n" +
                "Гораций\n" +
                "Горгоний\n" +
                "Гордей\n" +
                "Гостомысл\n" +
                "Гремислав\n" +
                "Григорий\n" +
                "Гурий\n" +
                "Гурьян\n" +
                "Давид\n" +
                "Давыд\n" +
                "Далмат\n" +
                "Даниил\n" +
                "Данил\n" +
                "Данила\n" +
                "Дементий\n" +
                "Демид\n" +
                "Демьян\n" +
                "Денис\n" +
                "Денисий\n" +
                "Димитрий\n" +
                "Диомид\n" +
                "Дионисий\n" +
                "Дмитрий\n" +
                "Добромысл\n" +
                "Добрыня\n" +
                "Довмонт\n" +
                "Доминик\n" +
                "Донат\n" +
                "Доримедонт\n" +
                "Дормедонт\n" +
                "Дормидбнт\n" +
                "Дорофей\n" +
                "Досифей\n" +
                "Евгений\n" +
                "Евграф\n" +
                "Евграфий\n" +
                "Евдоким\n" +
                "Евлампий\n" +
                "Евлогий\n" +
                "Евмен\n" +
                "Евмений\n" +
                "Евсей\n" +
                "Евстафий\n" +
                "Евстахий\n" +
                "Евстигней\n" +
                "Евстрат\n" +
                "Евстратий\n" +
                "Евтихий\n" +
                "Евфимий\n" +
                "Егор\n" +
                "Егорий\n" +
                "Елизар\n" +
                "Елисей\n" +
                "Елистрат\n" +
                "Елпидифор\n" +
                "Емельян\n" +
                "Епифан\n" +
                "Епифаний\n" +
                "Еремей\n" +
                "Ермий\n" +
                "Ермил\n" +
                "Ермила\n" +
                "Ермилий\n" +
                "Ермолай\n" +
                "Ерофей\n" +
                "Ефим\n" +
                "Ефимий\n" +
                "Ефрем\n" +
                "Ефремий\n" +
                "Захар\n" +
                "Захарий\n" +
                "Зенон\n" +
                "Зиновий\n" +
                "Зосим\n" +
                "Зосима\n" +
                "Иаким\n" +
                "Иакинф\n" +
                "Иван\n" +
                "Игнат\n" +
                "Игнатий\n" +
                "Игорь\n" +
                "Иероним\n" +
                "Измаил\n" +
                "Измарагд\n" +
                "Изосим\n" +
                "Изот\n" +
                "Изяслав\n" +
                "Илларион\n" +
                "Илиодор\n" +
                "Илья\n" +
                "Иннокентий\n" +
                "Иоанн\n" +
                "Йов\n" +
                "Иона\n" +
                "Иосафат\n" +
                "Иосиф\n" +
                "Ипат\n" +
                "Ипатий\n" +
                "Ипполит\n" +
                "Ираклий\n" +
                "Иринарх\n" +
                "Ириней\n" +
                "Иродион\n" +
                "Исаак\n" +
                "Исаакин\n" +
                "Исай\n" +
                "Исак\n" +
                "Исакий\n" +
                "Исидор\n" +
                "Иустин\n" +
                "Казимир\n" +
                "Каллимах\n" +
                "Каллиник\n" +
                "Каллиопий\n" +
                "Каллист\n" +
                "Каллистрат\n" +
                "Каллисфен\n" +
                "Калуф\n" +
                "Кандидий\n" +
                "Кантидиан\n" +
                "Капик\n" +
                "Капитон\n" +
                "Карион\n" +
                "Карл\n" +
                "Карп\n" +
                "Кастрихий\n" +
                "Касьян \n" +
                "Ким\n" +
                "Киприан\n" +
                "Кир\n" +
                "Кириак\n" +
                "Кирик\n" +
                "Кирилл\n" +
                "Кирсан\n" +
                "Клавдий\n" +
                "Клим\n" +
                "Климент\n" +
                "Климентий\n" +
                "Кондрат\n" +
                "Кондратий\n" +
                "Конон\n" +
                "Конрад\n" +
                "Константин\n" +
                "Корней\n" +
                "Корнелий\n" +
                "Корнил\n" +
                "Корнилий\n" +
                "Ксенофонт\n" +
                "Кузьма\n" +
                "Куприян\n" +
                "Лавр\n" +
                "Лаврентий\n" +
                "Ладимир\n" +
                "Лазарь\n" +
                "Ларион\n" +
                "Лев\n" +
                "Леон\n" +
                "Леонард\n" +
                "Леонид\n" +
                "Леонтий\n" +
                "Леопольд\n" +
                "Логвин\n" +
                "Лонгин\n" +
                "Лука\n" +
                "Лукан\n" +
                "Лукьян\n" +
                "Любим\n" +
                "Любомир\n" +
                "Любомысл\n" +
                "Люциан\n" +
                "Мавр\n" +
                "Маврикий\n" +
                "Мавродий\n" +
                "Май\n" +
                "Макар\n" +
                "Макарий\n" +
                "Македон\n" +
                "Македоний\n" +
                "Максим\n" +
                "Максимиан\n" +
                "Максимилиан\n" +
                "Малх\n" +
                "Мануил\n" +
                "Марат\n" +
                "Мардарий\n" +
                "Мариан\n" +
                "Марин\n" +
                "Марк\n" +
                "Маркел\n" +
                "Маркиан\n" +
                "Марлен\n" +
                "Мартимьян\n" +
                "Мартин\n" +
                "Мартиниан\n" +
                "Мартирий\n" +
                "Мартин\n" +
                "Мартьян\n" +
                "Матвей\n" +
                "Мелентий\n" +
                "Мелетий\n" +
                "Меркул\n" +
                "Меркурий\n" +
                "Мефодий\n" +
                "Мечислав\n" +
                "Милан\n" +
                "Милен\n" +
                "Милий\n" +
                "Мина\n" +
                "Минай\n" +
                "Мирон\n" +
                "Мирослав\n" +
                "Мисаил\n" +
                "Митрофан\n" +
                "Митрофаний\n" +
                "Михаил\n" +
                "Михей\n" +
                "Модест\n" +
                "Моисей\n" +
                "Мокей\n" +
                "Мокий\n" +
                "Мстислав\n" +
                "Назар\n" +
                "Назарий\n" +
                "Наркис\n" +
                "Натан\n" +
                "Наум\n" +
                "Нестер\n" +
                "Нестор\n" +
                "Нефёд\n" +
                "Никандр\n" +
                "Никанор\n" +
                "Никита\n" +
                "Никифор\n" +
                "Никодим\n" +
                "Николай\n" +
                "Никон\n" +
                "Нил\n" +
                "Нифонт\n" +
                "Олег\n" +
                "Олимпий\n" +
                "Онисим\n" +
                "Онисифор\n" +
                "Онуфрий\n" +
                "Орест\n" +
                "Осип\n" +
                "Оскар\n" +
                "Остап\n" +
                "Остромир\n" +
                "Павел\n" +
                "Павлин\n" +
                "Паисий\n" +
                "Палладий\n" +
                "Памфил\n" +
                "Памфилий\n" +
                "Панкрат\n" +
                "Панкратий\n" +
                "Пантелей\n" +
                "Пантелеймон\n" +
                "Панфил\n" +
                "Парамон\n" +
                "Пармен\n" +
                "Парфён\n" +
                "Парфений\n" +
                "Парфентий\n" +
                "Патрикей\n" +
                "Патрикий\n" +
                "Пафнутий\n" +
                "Пахом\n" +
                "Пахомий\n" +
                "Перфилий\n" +
                "Пётр\n" +
                "Пимен\n" +
                "Питирим\n" +
                "Платон\n" +
                "Полиевкт\n" +
                "Полиект\n" +
                "Поликарп\n" +
                "Поликарпий\n" +
                "Порфир\n" +
                "Порфирий\n" +
                "Потап\n" +
                "Потапий\n" +
                "Пров\n" +
                "Прокл\n" +
                "Прокоп\n" +
                "Прокопий\n" +
                "Прокофий\n" +
                "Протас\n" +
                "Протасий\n" +
                "Прохор\n" +
                "Радий\n" +
                "Радим\n" +
                "Радислав\n" +
                "Радован\n" +
                "Ратибор \n" +
                "Ратмир\n" +
                "Рафаил\n" +
                "Роберт\n" +
                "Родион\n" +
                "Роман\n" +
                "Ростислав\n" +
                "Рубен\n" +
                "Рувим\n" +
                "Рудольф\n" +
                "Руслан\n" +
                "Рюрик\n" +
                "Савва\n" +
                "Савватей\n" +
                "Савватий\n" +
                "Савёл\n" +
                "Савелий\n" +
                "Саверий\n" +
                "Савин \n" +
                "Савиниан\n" +
                "Сакердон\n" +
                "Салтан\n" +
                "Самбила\n" +
                "Самсон\n" +
                "Самсоний\n" +
                "Самуил\n" +
                "Светозар\n" +
                "Свирид\n" +
                "Святополк\n" +
                "Святослав\n" +
                "Себастьян\n" +
                "Севастьян\n" +
                "Северин\n" +
                "Северьян\n" +
                "Селиван\n" +
                "Селивёрст\n" +
                "Селифан\n" +
                "Семён\n" +
                "Семион\n" +
                "Серапион\n" +
                "Серафим\n" +
                "Сергей\n" +
                "Сигизмунд\n" +
                "Сидор\n" +
                "Сила\n" +
                "Силан\n" +
                "Силантий\n" +
                "Силуян\n" +
                "Сильван\n" +
                "Сильвестр\n" +
                "Симон\n" +
                "Смарагд\n" +
                "Созон\n" +
                "Созонт\n" +
                "Созонтий\n" +
                "Сократ\n" +
                "Соломон\n" +
                "Сосипатр\n" +
                "Софон\n" +
                "Софоний\n" +
                "Софрон\n" +
                "Софроний\n" +
                "Спартак\n" +
                "Спиридон\n" +
                "Спиридоний\n" +
                "Станимир\n" +
                "Стахий\n" +
                "Станислав\n" +
                "Степан\n" +
                "Стоян\n" +
                "Стратбник\n" +
                "Сысой\n" +
                "Тарас\n" +
                "Твердислав\n" +
                "Творимир\n" +
                "Терентий\n" +
                "Тертий\n" +
                "Тигран\n" +
                "Тигрий\n" +
                "Тимофей\n" +
                "Тимур\n" +
                "Тит\n" +
                "Тихон\n" +
                "Тристан\n" +
                "Трифилий\n" +
                "Трифон\n" +
                "Трофим\n" +
                "Увар\n" +
                "Ульян\n" +
                "Устин\n" +
                "Фабиан\n" +
                "Фадей\n" +
                "Фалалей\n" +
                "Фатьян\n" +
                "Фёдор\n" +
                "Федос\n" +
                "Федосей\n" +
                "Федосий\n" +
                "Федот\n" +
                "Федотий\n" +
                "Федул\n" +
                "Феликс\n" +
                "Фемистокл\n" +
                "Феогност\n" +
                "Феоктист\n" +
                "Феофан\n" +
                "Феофил\n" +
                "Феофилакт\n" +
                "Ферапонт\n" +
                "Филарет\n" +
                "Филат\n" +
                "Филимон\n" +
                "Филипий\n" +
                "Филипп\n" +
                "Филофей\n" +
                "Фирс\n" +
                "Флавиан\n" +
                "Флавий\n" +
                "Флегонт\n" +
                "Флорентий\n" +
                "Флорентин\n" +
                "Флориан\n" +
                "Фока\n" +
                "Фома\n" +
                "Фортунат\n" +
                "Фотий\n" +
                "Фридрих\n" +
                "Фрол\n" +
                "Харитон\n" +
                "Харитоний\n" +
                "Харлам\n" +
                "Харламп\n" +
                "Харлампий\n" +
                "Хрисанф\n" +
                "Христофор\n" +
                "Эдуард\n" +
                "Эмилий\n" +
                "Эмиль\n" +
                "Эммануил\n" +
                "Эразм\n" +
                "Эраст\n" +
                "Эрнест\n" +
                "Эрнст\n" +
                "Ювеналий\n" +
                "Юлиан\n" +
                "Юлий\n" +
                "Юрий\n" +
                "Юстиниан\n" +
                "Яким\n" +
                "Яков\n" +
                "Якуб\n" +
                "Ян\n" +
                "Януарий\n" +
                "Ярополк\n" +
                "Ярослав";
        names[1] =
                "Августа\n" + "Августина\n" + "Авдотья\n" + "Аврелия\n" + "Аврея\n" + "Аврора\n" + "Агапа\n" + "Агапия\n" + "Агарь\n" + "Агита\n" + "Агафа\n" + "Агафоклия\n" + "Агафоника\n" + "Агафья\n" + "Агафия\n" + "Аглаида\n" + "Аглая\n" + "Агна\n" + "Агнесса\n" + "Агния\n" + "Аграфена\n" + "Агриппина\n" +
                "Ада\n" + "Аделаида\n" + "Аделина\n" + "Аделла\n" + "Адель\n" + "Адельфина\n" + "Адина\n" + "Адолия\n" + "Адриана\n" + "Аза\n" + "Азалия\n" + "Азелла\n" + "Аида\n" + "Акилина\n" + "Аксинья\n" + "Аксиния\n" + "Акулина\n" + "Алевтина\n" + "Александра\n" + "Александрина\n" + "Алексина\n" +
                "Алёна\n" +
                "Алина\n" +
                "Алиса\n" +
                "Алла\n" +
                "Алфея\n" +
                "Альберта\n" +
                "Альбертина\n" +
                "Альбина\n" +
                "Альвина\n" +
                "Альфия\n" +
                "Амалия\n" +
                "Амата\n" +
                "Амелфа\n" +
                "Анастасия\n" +
                "Анатолия\n" +
                "Ангела\n" +
                "Ангелика\n" +
                "Ангелина\n" +
                "Анджела\n" +
                "Андрея\n" +
                "Андрона\n" +
                "Андроника\n" +
                "Анжелика\n" +
                "Анисья\n" +
                "Анисия\n" +
                "Анна\n" +
                "Антигона\n" +
                "Антониана\n" +
                "Антонида\n" +
                "Антонина\n" +
                "Антония\n" +
                "Анфима\n" +
                "Анфиса\n" +
                "Анфия\n" +
                "Анфуса\n" +
                "Аполлинария\n" +
                "Аполлония\n" +
                "Апраксин\n" +
                "Апрелия\n" +
                "Апфия\n" +
                "Аргентея\n" +
                "Ариадна\n" +
                "Арина\n" +
                "Ария\n" +
                "Арминия\n" +
                "Арсения\n" +
                "Артемида\n" +
                "Артемия\n" +
                "Аста\n" +
                "Астра\n" +
                "Афанасия\n" +
                "Аэлита\n" +
                "Беата\n" +
                "Беатриса\n" +
                "Белла\n" +
                "Бенедикта\n" +
                "Берта\n" +
                "Бландина\n" +
                "Богдана\n" +
                "Божена\n" +
                "Болеслава\n" +
                "Борислава\n" +
                "Бояна\n" +
                "Бронислава\n" +
                "Валентина\n" +
                "Валенсия\n" +
                "Валерия\n" +
                "Ванда\n" +
                "Васёна\n" +
                "Василида\n" +
                "Василина\n" +
                "Василиса\n" +
                "Василия\n" +
                "Василла\n" +
                "Васса\n" +
                "Вацлава\n" +
                "Вевея\n" +
                "Велимира\n" +
                "Велислава\n" +
                "Венедикта\n" +
                "Венуста\n" +
                "Венцеслава\n" +
                "Вера\n" +
                "Вереника\n" +
                "Вероника\n" +
                "Вербния\n" +
                "Веселина\n" +
                "Веста\n" +
                "Вестита\n" +
                "Вива\n" +
                "Вивея\n" +
                "Вивиана\n" +
                "Видина\n" +
                "Викентия\n" +
                "Викторина\n" +
                "Виктбрия\n" +
                "Вила\n" +
                "Вилена\n" +
                "Виленина\n" +
                "Вильгельмина\n" +
                "Виолетта\n" +
                "Виргиния\n" +
                "Виринея\n" +
                "Вита\n" +
                "Виталика\n" +
                "Виталина\n" +
                "Виталия\n" +
                "Витольда\n" +
                "Влада\n" +
                "Владилена\n" +
                "Владимира\n" +
                "Владислава\n" +
                "Владлена\n" +
                "Воислава\n" +
                "Воля\n" +
                "Всеслава\n" +
                "Гала\n" +
                "Галата\n" +
                "Галатея\n" +
                "Гали\n" +
                "Галина\n" +
                "Галла\n" +
                "Галя\n" +
                "Гая\n" +
                "Геласия\n" +
                "Гемелла\n" +
                "Гемина\n" +
                "Гения\n" +
                "Геннадия\n" +
                "Геновефа\n" +
                "Генриетта\n" +
                "Георгина\n" +
                "Гера\n" +
                "Германа\n" +
                "Гертруда\n" +
                "Гея\n" +
                "Глафира\n" +
                "Гликерия\n" +
                "Глорибза\n" +
                "Голиндуха\n" +
                "Гонеста\n" +
                "Гонората\n" +
                "Горгония\n" +
                "Горислава\n" +
                "Гортензия\n" +
                "Градислава\n" +
                "Грета\n" +
                "Далила\n" +
                "Даная\n" +
                "Дарья\n" +
                "Дария\n" +
                "Дебора\n" +
                "Деена\n" +
                "Декабрена\n" +
                "Денесия\n" +
                "Денница\n" +
                "Дея\n" +
                "Диана\n" +
                "Дигна\n" +
                "Дина\n" +
                "Диодора\n" +
                "Дионина\n" +
                "Дия\n" +
                "Доброгнева\n" +
                "Добромила\n" +
                "Добромира\n" +
                "Доброслава\n" +
                "Доминика\n" +
                "Домитилла\n" +
                "Домна\n" +
                "Домника\n" +
                "Домникия\n" +
                "Домнина\n" +
                "Донара\n" +
                "Доната\n" +
                "Дора\n" +
                "Дорофея\n" +
                "Доса\n" +
                "Досифея\n" +
                "Дросида\n" +
                "Дуклида\n" +
                "Ева\n" +
                "Евангелина\n" +
                "Еванфия\n" +
                "Евгения\n" +
                "Евдокия\n" +
                "Евдоксия\n" +
                "Евлалия\n" +
                "Евлампия\n" +
                "Евмения\n" +
                "Евминия\n" +
                "Евника\n" +
                "Евникия\n" +
                "Евномия\n" +
                "Евпраксия\n" +
                "Евсевия\n" +
                "Евстафия\n" +
                "Евстолия\n" +
                "Евтихия\n" +
                "Евтропия\n" +
                "Евфалия\n" +
                "Евфимия\n" +
                "Евфросиния\n" +
                "Екатерина\n" +
                "Елена\n" +
                "Елизавета\n" +
                "Еликонида\n" +
                "Епистима\n" +
                "Епистимия\n" +
                "Ермиония\n" +
                "Ефимия\n" +
                "Ефимья\n" +
                "Ефросиния\n" +
                "Ефросинья\n" +
                "Жанна\n" +
                "Жозефина\n" +
                "Зара\n" +
                "Зарема\n" +
                "Зарина\n" +
                "Зари\n" +
                "Зарина\n" +
                "Звезда\n" +
                "Земфира\n" +
                "Зенона\n" +
                "Зина\n" +
                "Зинаида\n" +
                "Зиновия\n" +
                "Злата\n" +
                "Зоя\n" +
                "Ива\n" +
                "Иванна\n" +
                "Ида\n" +
                "Идея\n" +
                "Изабелла\n" +
                "Изида\n" +
                "Изольда\n" +
                "Илария\n" +
                "Илия\n" +
                "Ильина\n" +
                "Инга\n" +
                "Инесса\n" +
                "Инна\n" +
                "Иоанна\n" +
                "Иовилла\n" +
                "Иола\n" +
                "Иоланта\n" +
                "Ипполита\n" +
                "Ираида\n" +
                "Ирина\n" +
                "Ирма\n" +
                "Исидора\n" +
                "Ифигения\n" +
                "Ия\n" +
                "Каздоя\n" +
                "Казимира\n" +
                "Калерия\n" +
                "Калида\n" +
                "Калиса\n" +
                "Каллиникия\n" +
                "Каллиста\n" +
                "Каллисфения\n" +
                "Кама\n" +
                "Камилла\n" +
                "Кандида\n" +
                "Капитолина\n" +
                "Карина\n" +
                "Каролина\n" +
                "Касиния\n" +
                "Келестина\n" +
                "Керкира\n" +
                "Кетевань\n" +
                "Кикилия\n" +
                "Кима\n" +
                "Кира\n" +
                "Кириакия\n" +
                "Кириана\n" +
                "Кирьяна\n" +
                "Кирилла\n" +
                "Клавдия\n" +
                "Клара\n" +
                "Клариса\n" +
                "Клементина\n" +
                "Клеопатра\n" +
                "Конкордия\n" +
                "Констанция\n" +
                "Корнелия\n" +
                "Кристина\n" +
                "Ксанфиппа\n" +
                "Ксения\n" +
                "Купава\n" +
                "Лавиния\n" +
                "Лавра\n" +
                "Лада\n" +
                "Лариса\n" +
                "Лаура\n" +
                "Леда\n" +
                "Лейла\n" +
                "Лемира\n" +
                "Ленина\n" +
                "Леокадия\n" +
                "Леонида\n" +
                "Леонила\n" +
                "Леонина\n" +
                "Лебния\n" +
                "Лея\n" +
                "Лиана\n" +
                "Ливия\n" +
                "Лидия\n" +
                "Лилиана\n" +
                "Лилия\n" +
                "Лина\n" +
                "Лира\n" +
                "Лия\n" +
                "Лилия\n" +
                "Лонгина\n" +
                "Лора\n" +
                "Лота\n" +
                "Луиза\n" +
                "Лукерья\n" +
                "Лукиана\n" +
                "Лукия\n" +
                "Лукреция\n" +
                "Любава\n" +
                "Любовь\n" +
                "Любомила\n" +
                "Любомира\n" +
                "Людмила\n" +
                "Люцина\n" +
                "Люция\n" +
                "Мавра\n" +
                "Магда\n" +
                "Магдалина\n" +
                "Магна\n" +
                "Маина\n" +
                "Майя\n" +
                "Макрина\n" +
                "Максима\n" +
                "Малания\n" +
                "Малинья\n" +
                "Малина\n" +
                "Мальвина\n" +
                "Мамелфа\n" +
                "Манефа\n" +
                "Маргарита\n" +
                "Мариам\n" +
                "Мариамна\n" +
                "Мариана\n" +
                "Марианна\n" +
                "Марьина\n" +
                "Мариетта\n" +
                "Марина\n" +
                "Марионилла\n" +
                "Мария\n" +
                "Марья\n" +
                "Марка\n" +
                "Маркеллина\n" +
                "Маркиана\n" +
                "Марксина\n" +
                "Марлена\n" +
                "Марта\n" +
                "Мартина\n" +
                "Мартиниана\n" +
                "Марфа\n" +
                "Марья\n" +
                "Мария\n" +
                "Марьяна\n" +
                "Марианна\n" +
                "Мастридия\n" +
                "Матильда\n" +
                "Матрёна\n" +
                "Матрона\n" +
                "Мая\n" +
                "Медея\n" +
                "Мелания\n" +
                "Меланья\n" +
                "Мелитика\n" +
                "Меркурия\n" +
                "Мерона\n" +
                "Милана\n" +
                "Милена\n" +
                "Милица\n" +
                "Милия\n" +
                "Милослава\n" +
                "Милютина\n" +
                "Мина\n" +
                "Минна\n" +
                "Минодора\n" +
                "Мира\n" +
                "Миропия\n" +
                "Мирослава\n" +
                "Мирра\n" +
                "Митродора\n" +
                "Михайлина\n" +
                "Млада\n" +
                "Модеста\n" +
                "Моика\n" +
                "Моника\n" +
                "Мстислава\n" +
                "Муза\n" +
                "Нада\n" +
                "Надежда\n" +
                "Нана\n" +
                "Наркисса\n" +
                "Настасия\n" +
                "Настасья\n" +
                "Наталия\n" +
                "Наталья\n" +
                "Нелли\n" +
                "Ненила\n" +
                "Неонила\n" +
                "Нида\n" +
                "Ника\n" +
                "Нила\n" +
                "Нимфа\n" +
                "Нимфодора\n" +
                "Нина\n" +
                "Нинель\n" +
                "Новелла\n" +
                "Нонна\n" +
                "Ноэми\n" +
                "Ноябрина\n" +
                "Нунехия\n" +
                "Оксана\n" +
                "Октавия\n" +
                "Октябрина\n" +
                "Олдама\n" +
                "Оливия\n" +
                "Олимпиада\n" +
                "Олимпиодора\n" +
                "Олимпия\n" +
                "Ольга\n" +
                "Ольда\n" +
                "Офелия\n" +
                "Павла\n" +
                "Павлина\n" +
                "Паисия\n" +
                "Паллада\n" +
                "Паллидия\n" +
                "Пальмира\n" +
                "Параскева\n" +
                "Патрикия\n" +
                "Пелагея\n" +
                "Перегрина\n" +
                "Перпетуя\n" +
                "Петра\n" +
                "Петрина\n" +
                "Петронилла\n" +
                "Петрония\n" +
                "Пиама\n" +
                "Пинна\n" +
                "Плакида\n" +
                "Плакилла\n" +
                "Платонида\n" +
                "Победа\n" +
                "Полактия\n" +
                "Поликсена\n" +
                "Поликсения\n" +
                "Полина\n" +
                "Поплия\n" +
                "Правдина\n" +
                "Прасковья\n" +
                "Препедигна\n" +
                "Прискилла\n" +
                "Просдока\n" +
                "Пульхерия\n" +
                "Пульхерья\n" +
                "Рада\n" +
                "Радана\n" +
                "Радислава\n" +
                "Радмила\n" +
                "Радомира\n" +
                "Радосвета\n" +
                "Радослава\n" +
                "Радость\n" +
                "Раиса\n" +
                "Рафаила\n" +
                "Рахиль\n" +
                "Ревекка\n" +
                "Ревмира\n" +
                "Регина\n" +
                "Рема\n" +
                "Рената\n" +
                "Римма\n" +
                "Рипсимия\n" +
                "Роберта\n" +
                "Рогнеда\n" +
                "Роза\n" +
                "Розалина\n" +
                "Розалинда\n" +
                "Розалия\n" +
                "Розина\n" +
                "Роксана\n" +
                "Романа\n" +
                "Ростислава\n" +
                "Русина\n" +
                "Руслана\n" +
                "Руфина\n" +
                "Руфиниана\n" +
                "Руфь\n" +
                "Сабина\n" +
                "Савватия\n" +
                "Савелла\n" +
                "Савина\n" +
                "Саломея\n" +
                "Сильвия\n" +
                "Самона\n" +
                "Сарра\n" +
                "Сатира\n" +
                "Светислава\n" +
                "Светлана\n" +
                "Светозара\n" +
                "Святослава\n" +
                "Севастьяна\n" +
                "Северина\n" +
                "Секлетея\n" +
                "Секлетинья\n" +
                "Селена\n" +
                "Селестина\n" +
                "Селина\n" +
                "Серафима\n" +
                "Сибилла\n" +
                "Сильва\n" +
                "Сильвана\n" +
                "Сильвестра\n" +
                "Сильвия\n" +
                "Симона\n" +
                "Синклитикия\n" +
                "Сира\n" +
                "Слава\n" +
                "Снандулия\n" +
                "Снежана\n" +
                "Сола\n" +
                "Соломонида\n" +
                "Сосипатра\n" +
                "Софрония\n" +
                "Софья\n" +
                "София\n" +
                "Станислава\n" +
                "Стелла\n" +
                "Степанида\n" +
                "Стефанида\n" +
                "Стефания\n" +
                "Сусанна\n" +
                "Сюзанна\n" +
                "Тавифа\n" +
                "Таисия\n" +
                "Таисья\n" +
                "Тамара\n" +
                "Тарасия\n" +
                "Татьяна\n" +
                "Текуса\n" +
                "Тереза\n" +
                "Тигрия\n" +
                "Тихомира\n" +
                "Тихослава\n" +
                "Тома\n" +
                "Томила\n" +
                "Транквиллина\n" +
                "Трифена\n" +
                "Трофима\n" +
                "Улита\n" +
                "Ульяна\n" +
                "Урбана\n" +
                "Урсула\n" +
                "Устина\n" +
                "Устиния\n" +
                "Устинья\n" +
                "Фабиана\n" +
                "Фавста\n" +
                "Фавстина\n" +
                "Фаина\n" +
                "Фантика\n" +
                "Феврония\n" +
                "Февронья\n" +
                "Федоза\n" +
                "Федора\n" +
                "Федосия\n" +
                "Федосья\n" +
                "Федотия\n" +
                "Федотья\n" +
                "Федула\n" +
                "Фёкла\n" +
                "Фекуса\n" +
                "Феликса\n" +
                "Фелица\n" +
                "Фелицата\n" +
                "Фелициана\n" +
                "Фелицитата\n" +
                "Фелиция\n" +
                "Феогния\n" +
                "Феодора\n" +
                "Феодосия\n" +
                "Феодота\n" +
                "Феодотия\n" +
                "Феодула\n" +
                "Феодулия\n" +
                "Феозва\n" +
                "Феоктиста\n" +
                "Феона\n" +
                "Феонилла\n" +
                "Фебния\n" +
                "Феопистия\n" +
                "Феосовия\n" +
                "Феофания\n" +
                "Феофила\n" +
                "Фервуфа\n" +
                "Фессалоника\n" +
                "Фессалоникия\n" +
                "Фетиния\n" +
                "Фетинья\n" +
                "Фея\n" +
                "Фива\n" +
                "Фивея\n" +
                "Филарета\n" +
                "Филиппа\n" +
                "Филиппин\n" +
                "Филомена\n" +
                "Филонилла\n" +
                "Филофея\n" +
                "Фиста\n" +
                "Флавия\n" +
                "Флёна\n" +
                "Флора\n" +
                "Флорентина\n" +
                "Флоренция\n" +
                "Флориана\n" +
                "Флорида\n" +
                "Фомаида\n" +
                "Фортуната\n" +
                "Фотина\n" +
                "Фотиния\n" +
                "Фотинья\n" +
                "Франциска\n" +
                "Фрида\n" +
                "Фридерика\n" +
                "Хаврония\n" +
                "Хариесса\n" +
                "Хариса\n" +
                "Харита\n" +
                "Харитина\n" +
                "Хиония\n" +
                "Хриса\n" +
                "Хрисия\n" +
                "Христиана\n" +
                "Христина\n" +
                "Цвета\n" +
                "Цветана\n" +
                "Целестина\n" +
                "Цецилия\n" +
                "Шарлотта\n" +
                "Шушаника\n" +
                "Эвелина\n" +
                "Эгина\n" +
                "Эдит\n" +
                "Элеонора\n" +
                "Элисса\n" +
                "Элла\n" +
                "Эллада\n" +
                "Эллина\n" +
                "Элоиза\n" +
                "Эльвира\n" +
                "Эмилиана\n" +
                "Эмилия\n" +
                "Эмма\n" +
                "Эннафа\n" +
                "Эра\n" +
                "Эрнеста\n" +
                "Эрнестина\n" +
                "Эсмеральда\n" +
                "Эсфирь\n" +
                "Юдифь\n" +
                "Юлиана\n" +
                "Юлиания\n" +
                "Юлия\n" +
                "Юния\n" +
                "Юнона\n" +
                "Юрия\n" +
                "Юстина\n" +
                "Ядвига\n" +
                "Яна\n" +
                "Янина\n" +
                "Ярослава";
        try {
            for (int i = 0; i < 2; i++) {
                String FileName = "names" + i;
                OutputStreamWriter outputStreamWriter = new OutputStreamWriter(ctx.openFileOutput(FileName, ctx.MODE_PRIVATE));
                outputStreamWriter.write(names[i]);
                outputStreamWriter.close();
            }
        } catch (FileNotFoundException e) {
            Log.e("Exception", "File not founded: " + e.toString());
        } catch (IOException e) {
            Log.e("Exception", "File write failed: " + e.toString());
        }
    }
    void CreateFileCountry (Context ctx){
        String country =
                "Австралия\n" +
                "Австрия\n" +
                "Автономное Силезское воеводство\n" +
                "Азербайджан\n" +
                "Албания\n" +
                "Алжир\n" +
                "Американское Самоа\n" +
                "Ангилья\n" +
                "Англия\n" +
                "Ангола\n" +
                "Андорра\n" +
                "Антигуа и Барбуда\n" +
                "Аргентина\n" +
                "Армения\n" +
                "Аруба\n" +
                "Афганистан\n" +
                "Багамские Острова\n" +
                "Бангладеш\n" +
                "Барбадос\n" +
                "Бахрейн\n" +
                "Бейкер\n" +
                "Белиз\n" +
                "Белоруссия\n" +
                "Бельгия\n" +
                "Бенилюкс\n" +
                "Бенин\n" +
                "Бермудские Острова\n" +
                "Болгария\n" +
                "Боливия\n" +
                "Бонэйр, Синт-Эстатиус и Саба\n" +
                "Бопутатсвана\n" +
                "Босния и Герцеговина\n" +
                "Ботсвана\n" +
                "Бразилия\n" +
                "Британская антарктическая территория\n" +
                "Британская Территория в Индийском Океане\n" +
                "Бруней\n" +
                "Буркина-Фасо\n" +
                "Бурунди\n" +
                "Бутан\n" +
                "Вануату\n" +
                "Ватикан\n" +
                "Великобритания\n" +
                "Венгрия\n" +
                "Венда\n" +
                "Венесуэла\n" +
                "Виргинские Острова\n" +
                "Восточный Тимор\n" +
                "Вьетнам\n" +
                "Габон\n" +
                "Республика Гаити\n" +
                "Гайана\n" +
                "Галактическая Республика\n" +
                "Гамбия\n" +
                "Гана\n" +
                "Гватемала\n" +
                "Гвинея\n" +
                "Гвинея-Бисау\n" +
                "Германия\n" +
                "Гернси\n" +
                "Гибралтар\n" +
                "Гондурас\n" +
                "Гонконг\n" +
                "Государство Центральных регионов Сомали\n" +
                "Гренада\n" +
                "Греция\n" +
                "Грузия\n" +
                "Гуам\n" +
                "Дания\n" +
                "Демократическая Республика Конго\n" +
                "Демократическая Федерация Северной Сирии\n" +
                "Джарвис\n" +
                "Джерси\n" +
                "Джибути\n" +
                "Джонстон\n" +
                "Джубаленд\n" +
                "Доминика\n" +
                "Доминиканская Республика\n" +
                "Египет\n" +
                "Замбия\n" +
                "Зимбабве\n" +
                "Израиль\n" +
                "Имамат Оман\n" +
                "Империя Атлантиум\n" +
                "Индия\n" +
                "Индонезия\n" +
                "Иордания\n" +
                "Ирак\n" +
                "Иракский Курдистан\n" +
                "Иран\n" +
                "Ирландия\n" +
                "Исламское государство\n" +
                "Исландия\n" +
                "Испания\n" +
                "Италия\n" +
                "Йемен\n" +
                "Султанат Касири\n" +
                "Кабо-Верде\n" +
                "Казахстан\n" +
                "Камбоджа\n" +
                "Камерун\n" +
                "Канада\n" +
                "Карриаку и Малый Мартиник\n" +
                "Катар\n" +
                "Кашубия\n" +
                "Кения\n" +
                "Риф Кингмен\n" +
                "Республика Кипр\n" +
                "Киргизия\n" +
                "Кирибати\n" +
                "Китай\n" +
                "Княжество Хатт-Ривер\n" +
                "Кокосовые острова\n" +
                "Колумбия\n" +
                "Коморы\n" +
                "Республика Конго\n" +
                "Корейская Народно-Демократическая Республика\n" +
                "Республика Корея\n" +
                "Королевство Нидерландов\n" +
                "Коста-Рика\n" +
                "Кот-д’Ивуар\n" +
                "Куба\n" +
                "Кувейт\n" +
                "Острова Кука\n" +
                "Кюрасао\n" +
                "Лаос\n" +
                "Латвия\n" +
                "Лесото\n" +
                "Либерия\n" +
                "Ливан\n" +
                "Ливия\n" +
                "Литва\n" +
                "Лихтенштейн\n" +
                "Люксембург\n" +
                "Маврикий\n" +
                "Мавритания\n" +
                "Мадагаскар\n" +
                "Малави\n" +
                "Малайзия\n" +
                "Мали\n" +
                "Мальдивы\n" +
                "Мальта\n" +
                "Мальтийский орден\n" +
                "Марокко\n" +
                "Мартиазо\n" +
                "Маршалловы Острова\n" +
                "Мексика\n" +
                "Мидуэй\n" +
                "Мозамбик\n" +
                "Молдавия\n" +
                "Монако\n" +
                "Монголия\n" +
                "Монтсеррат\n" +
                "Мьянма\n" +
                "Намибия\n" +
                "Науру\n" +
                "Независимость Азербайджана\n" +
                "Непал\n" +
                "Нигер\n" +
                "Нигерия\n" +
                "Нидерланды\n" +
                "Никарагуа\n" +
                "Ниуэ\n" +
                "Новая Зеландия\n" +
                "Новая Каледония\n" +
                "Норвегия\n" +
                "Остров Норфолк\n" +
                "Объединённые Арабские Эмираты\n" +
                "Оман\n" +
                "Острова Святой Елены, Вознесения и Тристан-да-Кунья\n" +
                "Пакистан\n" +
                "Палау\n" +
                "Памятные монеты евро Германии\n" +
                "Панама\n" +
                "Папуа\n" +
                "Парагвай\n" +
                "Перу\n" +
                "Острова Питкэрн\n" +
                "Польша\n" +
                "Португалия\n" +
                "Провинция Бумбунга\n" +
                "Пуэрто-Рико\n" +
                "Республика Логон\n" +
                "Остров Рождества\n" +
                "Россия\n" +
                "Руанда\n" +
                "Румыния\n" +
                "Саба\n" +
                "Сальвадор\n" +
                "Самоа\n" +
                "Сан-Марино\n" +
                "Сан-Томе и Принсипи\n" +
                "Саудовская Аравия\n" +
                "Северная Ирландия\n" +
                "Северная Македония\n" +
                "Сейшельские Острова\n" +
                "Сен-Мартен\n" +
                "Сенегал\n" +
                "Сент-Винсент и Гренадины\n" +
                "Сент-Китс и Невис\n" +
                "Сент-Люсия\n" +
                "Сербия\n" +
                "Силенд\n" +
                "Сингапур\n" +
                "Синт-Мартен\n" +
                "Синт-Эстатиус\n" +
                "Сирия\n" +
                "Сискей\n" +
                "Словакия\n" +
                "Словения\n" +
                "Соломоновы Острова\n" +
                "Сомали\n" +
                "Сомалиленд\n" +
                "Союзное государство\n" +
                "Судан\n" +
                "Суринам\n" +
                "Соединённые Штаты Америки\n" +
                "Сьерра-Леоне\n" +
                "Таджикистан\n" +
                "Таиланд\n" +
                "Танзания\n" +
                "Теркс и Кайкос\n" +
                "Того\n" +
                "Токелау\n" +
                "Тонга\n" +
                "Торо\n" +
                "Транскей\n" +
                "Тринидад и Тобаго\n" +
                "Тувалу\n" +
                "Тунис\n" +
                "Туркмения\n" +
                "Турция\n" +
                "Уганда\n" +
                "Узбекистан\n" +
                "Украина\n" +
                "Уоллис и Футуна\n" +
                "Уругвай\n" +
                "Уэйк\n" +
                "Уэльс\n" +
                "Федеративные Штаты Микронезии\n" +
                "Фиджи\n" +
                "Филиппины\n" +
                "Финляндия\n" +
                "Фландренсис\n" +
                "Фолклендские острова\n" +
                "Франция\n" +
                "Французская Полинезия\n" +
                "Хауленд\n" +
                "Хиршабелле\n" +
                "Хорватия\n" +
                "Центральноафриканская Республика\n" +
                "Чад\n" +
                "Черногория\n" +
                "Чехия\n" +
                "Чили\n" +
                "Швейцария\n" +
                "Швеция\n" +
                "Шотландия\n" +
                "Шри-Ланка\n" +
                "Эквадор\n" +
                "Экваториальная Гвинея\n" +
                "Эритрея\n" +
                "Эсватини\n" +
                "Эстония\n" +
                "Эфиопия\n" +
                "Южная Георгия и Южные Сандвичевы Острова\n" +
                "Южно-Африканская Республика\n" +
                "Южный Судан\n" +
                "Ямайка\n" +
                "Япония";
        try {
            String FileName = "country" + 0;
            OutputStreamWriter outputStreamWriter = new OutputStreamWriter(ctx.openFileOutput(FileName, ctx.MODE_PRIVATE));
            outputStreamWriter.write(country);
            outputStreamWriter.close();
        } catch (FileNotFoundException e) {
            Log.e("Exception", "File not founded: " + e.toString());
        } catch (IOException e) {
            Log.e("Exception", "File write failed: " + e.toString());
        }
    }

    private void createAList(String theme, int k, Context ctx) {

        for(int i = 0; i < k; i++) {

            String fName = theme+i;
            try {

                InputStream inputStream = ctx.openFileInput(fName);
                if(inputStream != null) {

                    InputStreamReader inputStreamReader = new InputStreamReader(inputStream);
                    BufferedReader bufferedReader = new BufferedReader(inputStreamReader);
                    String tempString = "";

                    while ((tempString = bufferedReader.readLine()) != null) {
                        aList.add(tempString);
                    }

                    inputStream.close();
                }
            } catch (IOException e) {
                Log.e("Exception", "Failed reader: " + e.toString());
            }
        }
    }

    private void createAListHistory(Context ctx, int k) {

        try {

            InputStream inputStream = ctx.openFileInput("UserHistory"+k);
            if(inputStream != null) {

                InputStreamReader inputStreamReader = new InputStreamReader(inputStream);
                BufferedReader bufferedReader = new BufferedReader(inputStreamReader);
                String tempString = "";

                while ((tempString = bufferedReader.readLine()) != null) {
                    aListHistory.add(tempString);
                }
                inputStream.close();
            }

        } catch (FileNotFoundException e) {
            Log.e("App_Exceprion", e.toString());

        } catch (IOException e) {
            Log.d("App_Exception: ", e.toString());
        }
    }
    private void correcAList(Context ctx) {

        for(String tempString : aListHistory) {
            aList.remove(tempString);
        }
    }

    private void printHistory (String s, Context ctx, int k) {

        try {

            OutputStreamWriter outputStreamWriter = new OutputStreamWriter(ctx.openFileOutput("UserHistory"+k, ctx.MODE_APPEND));
            outputStreamWriter.write(s + "\n");
            outputStreamWriter.close();

        } catch (FileNotFoundException e) {
            Log.e("Exception", "File N/F: " + e.toString());

        } catch (IOException e) {
            Log.e("Exception", "File write failed: " + e.toString());
        }
    }
    boolean deleteHistory (Context ctx, int k) {
//        if (ctx.deleteFile("UserHistory"+k)){
//            return (true);
//        }
//        else {
//            return (false);
//        }
        return (ctx.deleteFile("UserHistory"+k));
    }

    boolean checkFiles (String fName,Context ctx) {

        try {

            InputStream inputStream = ctx.openFileInput(fName);
            if(inputStream != null) {

                InputStreamReader inputStreamReader = new InputStreamReader(inputStream);
                BufferedReader bufferedReader = new BufferedReader(inputStreamReader);
                inputStream.close();
            }
        } catch (FileNotFoundException e) {
          return (false);

        } catch (IOException e) {
            Log.e("Exception", "Failed reader: " + e.toString());
        }
        return (true);
    }

    String confirmWord(String word, String lSymb, String pastText, String theme, int k, Context ctx) {
        createAListHistory(ctx, k);
        createAList(theme, k, ctx);
        correcAList(ctx);

        String mess1 = "";
        String mess2 = "";

        switch (theme) {

            case "names":
                mess1 = " - Это имя уже называлось";
                mess2 = " - Указанного имени не существует";
                break;

            case "towns":
                mess1 = " - Этот город уже назывался";
                mess2 = " - Указанного города не существует";
                break;

            case "country":
                mess1 = " - Эта страна уже называлась";
                mess2 = " - Указанной страны не существует";
        }
        if(aListHistory.contains(word)){
//            for(String tempString : aList) {
//                if (!tempString.matches("^" + lSymb + ".*")) {
//                    return ("IAmWin");
//                }
//                else
//                    break;
//            }
            return (mess1);
        }

        if(!aList.contains(word)){
            return (mess2);
        }

        aListHistory.add(word);
        aList.remove(word);
        printHistory(word, ctx, k);
        Log.d("App_LSymb", lSymb);
        for(String tempString : aList) {
            if (tempString.matches("^" + lSymb + ".*")) {
                aListTemp.add(tempString);
            }
        }
        if(aListTemp.size()==0) {
            return ("YouWin");
        }
        Log.d("App_AListTemp", aListTemp.toString());
        Collections.shuffle(aListTemp);
        word = aListTemp.get(0);
        aListTemp.remove(word);
        aListTemp.clear();
        printHistory(word, ctx, k);
        aListHistory.add(word);
        Log.d("App_AList", aList.toString());
        Log.d("App_AListHistory", aListHistory.toString());
        return (word);
    }
}
